app/Models/PruebaTModel.php

    public function get_usuarios()
    {
        $query = $this->db->table('prueba_camaguey.usuarios_camaguey c')
            ->select('c.*')
            ->get();
---
SELECT "c".*
FROM "prueba_camaguey"."usuarios_camaguey" "c"